app/Controllers/CFrontend.php

    public function publikasi()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $cari = $this->publikasi->search($keyword);
        } else {
            $cari = $this->publikasi;
        }

        $publish = $cari->paginate(10, 'publikasi');
---
SELECT *
FROM `publikasi`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `publikasi`